of222/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    elecNorth
    {
        type            patch;
        nFaces          80;
        startFace       50880;
    }
    wallEast
    {
        type            wall;
        nFaces          80;
        startFace       50960;
    }
    wallWest
    {
        type            wall;
        nFaces          80;
        startFace       51040;
    }
    elecSouth
    {
        type            patch;
        nFaces          80;
        startFace       51120;
    }
    cylinder
    {
        type            wall;
        nFaces          320;
        startFace       51200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          51200;
        startFace       51520;
    }
)

// ************************************************************************* //
